In [2]:
import pandas as pd

1. Employee_Master.xlsx

In [154]:
df = pd.read_excel('Excel Files/Employee_Master (1).xlsx', sheet_name='Sheet1')
df.head(10)

   EmpID     Name   Age       City Department   Salary
0    101    Arjun  28.0      Kochi         IT  45000.0
1    102    Meera  31.0    Chennai    Finance  52000.0
2    103     Ravi  26.0      Delhi         HR  38000.0
3    104   Fatima  29.0  Bangalore         IT  60000.0
4    105     John  35.0      Kochi      Sales  72000.0
5    106   Devika  32.0    Chennai    Finance      NaN
6    107    Rahul  27.0  Hyderabad         IT  55000.0
7    108  Nimisha  30.0     Mumbai         HR  48000.0
8    109    Akhil   NaN      Delhi      Sales  69000.0
9    110     Sana  33.0      Kochi    Finance  75000.0

In [155]:
df.drop_duplicates(inplace=True)
df.fillna({"Age":df["Age"].mean()}, inplace=True)
df.fillna({"Salary":df["Salary"].mean()}, inplace=True)
df["Salary"].max()
df["Salary"].min()
df.groupby("Department")["Salary"].sum()

Department
Finance    184111.111111
HR          86000.000000
IT         160000.000000
Sales      141000.000000
Name: Salary, dtype: float64

In [156]:
new_df = df[df["Department"]=="IT"]
new_df.to_excel("ITdepartment.xlsx", sheet_name="IT", index=False)

2. Sales_Transactions.xlsx

In [157]:
df = pd.read_excel('Excel Files/Sales_Transactions.xlsx', sheet_name='Sheet1')
df["Product"].unique()
df.head()

   SaleID  Product  Qty  Unit_Price  Total_Value
0     501   Laptop    2       56000       112000
1     502   Mobile    5       18000        90000
2     503   Tablet    3       25000        75000
3     504   Laptop    1       55000        55000
4     505  Monitor    4       12000        48000

In [158]:
df["Total_Value"].sum()
df.groupby("Product").agg(Total_Revenue = ("Total_Value","sum")).reset_index()
df.groupby("Product")["Total_Value"].sum().max()
df[df["Qty"]>3]

   SaleID  Product  Qty  Unit_Price  Total_Value
1     502   Mobile    5       18000        90000
4     505  Monitor    4       12000        48000
6     507   Tablet    6       26000       156000
9     510   Mobile    4       16500        66000

3. Attendance Report

In [159]:
df = pd.read_excel("Excel Files/Attendance_Report.xlsx", sheet_name="Sheet1")
df.head()

   EmpID  Days_Present  Days_Absent  Work_From_Home
0    101            24            4               3
1    102            22            6               1
2    103            18           10               0
3    104            26            2               4
4    105            28            0               1

In [160]:
df["Total_WorkingDays"] = df["Days_Present"] + df["Days_Absent"]
df["Attendance%"] = ((df["Days_Present"] / df["Total_WorkingDays"])*100).round(2)
df[df["Attendance%"] < 75]
df.sort_values(by="Attendance%", ascending=False)

,EmpID,Days_Present,Days_Absent,Work_From_Home,Total_WorkingDays,Attendance%
4,105,28,0,1,28,100.00
7,108,27,1,5,28,96.43
3,104,26,2,4,28,92.86
5,106,25,3,2,28,89.29
0,101,24,4,3,28,85.71
1,102,22,6,1,28,78.57
8,109,22,6,2,28,78.57
6,107,19,9,0,28,67.86
2,103,18,10,0,28,64.29
9,110,0,30,0,30,0.00

4. Product Inventory

In [3]:
df = pd.read_excel("Excel Files/Product_Inventory.xlsx")
df.head()

   ProductID Product_Name     Category  Stock  Unit_Price
0        201        Mouse  Electronics     50         500
1        202     Keyboard  Electronics     40        1200
2        203      Monitor  Electronics     12        8500
3        204       Laptop  Electronics      5       55000
4        205      Charger  Accessories    100         900

In [4]:
df["Stock"].sum()
df["Unit_Price"].max()
df["Unit_Price"].min()
df[df["Stock"] < 50]
df.groupby("Category").agg(Total_Stock = ("Stock","sum")).reset_index()

      Category  Total_Stock
0  Accessories          125
1  Electronics          140
2      Storage           50

5. Student Marks

In [163]:
df = pd.read_excel("Excel Files/Student_Marks.xlsx")
df.head()

   StudentID   Name  Maths  Science  English
0        301  Ayaan     89       75       82
1        302   Neha     76       81       74
2        303  Rohit     65       55       68
3        304   Sara     92       88       91
4        305   Faiz     58       69       60

In [164]:
df["Avarage_Marks"] = df[["Maths","Science","English"]].mean(axis=1).round(1)
df["Total_Marks"] = df[["Maths","Science","English"]].sum(axis=1)
df.sort_values(by="Total_Marks",ascending=False).head(3)
df[["Maths","Science","English"]].mean().idxmin()

'Science'

6. Hospital_Patients.xlsx

In [166]:
df = pd.read_excel("Excel Files/Hospital_Patients.xlsx")
df.head()

   PatientID    Name  Age    Disease  Bill_Amount
0        401    Arav   34      Fever         3000
1        402   Mohan   45   Diabetes        12000
2        403    Sita   29  Infection         4500
3        404  Farhan   55      Heart        50000
4        405  Anjana   31     Asthma         6000

In [167]:
df["Bill_Amount"].sum()
df.groupby("Disease")["PatientID"].count()
df.sort_values(by="Bill_Amount", ascending=False).head(1)

   PatientID    Name  Age Disease  Bill_Amount
3        404  Farhan   55   Heart        50000

7. Ecommerce_Orders.xlsx

In [5]:
df = pd.read_excel("Excel Files/Ecommerce_Orders.xlsx")
df.head()

   OrderID Customer Product  Quantity  Order_Value
0      701     Ravi   Phone         1        20000
1      702     Arun   Shoes         2         3500
2      703    Megha  Laptop         1        58000
3      704   Swathi   Watch         3         4500
4      705     Noor   Phone         1        21000

In [6]:
df.groupby("Product").agg(Total_Order_Value = ("Order_Value","sum")).reset_index()
df.sort_values(by="Order_Value",ascending=False).head(1)
df.groupby("Product").agg(Total_Quantity = ("Quantity","sum")).reset_index()

  Product  Total_Quantity
0  Laptop               3
1   Phone               2
2   Shoes               3
3  Tablet               3
4   Watch               6

8. Bank Transcation

In [170]:
df = pd.read_excel("Excel Files/Bank_Transactions.xlsx")
df.head()

   TxnID Account_Holder    Type  Amount   Status
0    801           Arun  Credit   25000  Success
1    802           Jose   Debit   12000   Failed
2    803          Deepa  Credit   18000  Success
3    804         Akshay   Debit    5000  Success
4    805          Meera  Credit   32000  Success

In [171]:
df.groupby("Type")["Amount"].sum()
df[df["Status"]=="Failed"].shape[0]
df[(df["Status"]=="Success") & (df["Type"]=="Debit")]

   TxnID Account_Holder   Type  Amount   Status
3    804         Akshay  Debit    5000  Success
5    806          David  Debit   15000  Success
7    808           Zoya  Debit    8000  Success

9. Flight_Booking.xlsx

In [172]:
df = pd.read_excel("Excel Files/Flight_Booking.xlsx")
df.head()

   BookingID Passenger Source Destination   Fare
0        901     Kevin    DEL         DXB  22000
1        902      Asha    COK         SIN  35000
2        903     Bilal    BLR         LHR  58000
3        904     Diana    HYD         DXB  42000
4        905     Manoj    MUM         CMB  18000

In [173]:
df["Fare"].mean()
df.groupby("Source").size()
df.loc[[df["Fare"].idxmax()],["Passenger","Fare"]]

  Passenger   Fare
2     Bilal  58000